{
    "279ff49446f6ec8c21cac35713236d2e": "DISCOVERING THE TRUTH",
    "d4eeaa1b3fae580e8a1705bc2959f2ba": "Informal Negotiations",
    "6ba4f242802d57b407a00db4504bcb89": "I don't know how she found out, but it didn't matter; the sky had just witnessed a sad and bitter revelation. From that night on, the little child that I was experienced a complete upheaval. Yet, the lady with her kerosene lamp, who sympathized with me being there, nor any of the other neighbors ever thought of taking me into their house, laying me down on a small mat to warm my heart for just one night, even though I was their children's age. Gradually, I understood that my troubles were someone else's and didn't affect anyone else. Even if compassion never helped anyone, a small gesture, however minimal, would have sufficed...",
    "c3a64b7eb743551e2e8280faa58cf2cd": "This was especially applicable to me as I was experiencing cultural stigmas of prejudice around my birth. People would say, 'he is an orphan,' or 'he is from the street,' or 'he came from the swamp.'",
    "e28481c200aa39fe3d13a8364318e697": "We respect the intellectual property rights of others. If you believe that any material available on or through the Services infringes upon any copyright you own or control, please immediately notify us using the contact information provided below (a \"Notification\"). A copy of your Notification will be sent to the person who posted or stored the material addressed in the Notification. Please be advised that pursuant to applicable law, you may be held liable for damages if you make material misrepresentations in a Notification. Thus, if you are not sure that material located on or linked to by the Services infringes your copyright, you should consider first contacting an attorney.",
    "eed2edf34aa520369b6a971b576f87a3": "No law in the world has the right to deprive a child of knowing their parents, regardless of the circumstances surrounding their birth. Furthermore, I advise adopted, abandoned, or fostered children to search for their biological parents while there's still time. In my profession as a nurse, I often meet adopted children who don't want to know their origins. I understand them, but it's a pity!",
    "b1ebb6ed335589e1a55b624609373095": "Message to the adopted",
    "80d30a5786851655e0e5060266546405": "A call to action",
    "cfa7a4bcb7443bc42048687b2f99a549": "I understand that it may sometimes be difficult for you to tell us that you adopted us, and you have your reasons.",
    "34d1d6deea1f6bc025c7a0eaa5809e11": "I was abandoned a few days after my birth. By God's grace, wonderful people took me in. Here's the little story of my life.",
    "fe74a08197e213c7571a056f629d4317": "We care about data privacy and security. Please review our Privacy Policy:",
    "28787f72aded631c6e823598e203e60a": "Finally, my siblings from both sides were able to deal with the stigmas surrounding my life. BRAVO! BRAVO!",
    "e7e0b1e6a213b127a2c2e3f129e49441": "Make a donation",
    "a4ca1083cc2ea998b3ed7e3e8487a03e": "All these horrors I lived through are etched in my child's memory. I haven't forgotten anything; not even time has erased these memories. However, I managed to forgive so I could live in peace with myself and the world around me.",
    "96c903372094ab354cc59f37e9369dc7": "By Vinciane",
    "55161f779bdde5360a678832349a0141": "Together, we tried to find my biological mother, but in vain.",
    "548894486c1018b4ccd62caef1a518e6": "By using the Services, you agree to be bound by our Privacy Policy, which is incorporated into these Legal Terms. Please be advised the Services are hosted in Canada. If you access the Services from any other region of the world with laws or other requirements governing personal data collection, use, or disclosure that differ from applicable laws in Canada, then through your continued use of the Services, you are transferring your data to Canada, and you expressly consent to have your data transferred to and processed in Canada.",
    "16f7b1f197efb1f2f201f5a794248056": "Amazingly, my new siblings were so nice to me. They welcomed me as if we had been in touch for a long time. We went through a process of getting to know each other together, and it went smoothly, which is unusual in our culture.",
    "c724c15899b32e098a1385c2646f52db": "My father, an influential person in the community, was married and didn't want to reveal my existence. My mother chose to have me live with her brother and kept me a secret.",
    "b09c08d526d578ecc9fa11c68f06f4c9": "A difficult choice",
    "c33389119a1e15de813d2e9f9e997b1d": "INDEMNIFICATION**",
    "445d337b5cd5de476f99333df6b0c2a7": "Canada",
    "ed65ef0af4c5ca95fbaa8b4828aee9b2": "https://lifeninc.com/privacy",
    "ac14c590f63a6bfaa718ffc952ac3ff8": "The discovery of my adoption triggered a storm of emotions in me. I felt both betrayed and unwanted. My adoptive mother had hidden this truth from me, and in my mind, my biological parents had simply abandoned me.",
    "461aaa1ec24af91bebf07c206fc30bfc": "This 'secret' and all the mysteries surrounding it broke her. I was no longer the nurturing mother; I lost my place, and she rejected hers. She was searching for her bearings; her heart was bleeding. This emotional wound was so deep that it resulted in relational trauma. For nearly 20 years, she made me pay for it. I wished I could take it all on myself, but she also hurt herself a lot. One day, when I was at my lowest, my sister asked me a question that made me think: '...and if she had been born lame, would you have asked her to walk straight?' She was suffering terribly.",
    "b473883fc62a8fc16bcfee70e0053bd1": "If the search to find your blood family is unsuccessful, grieve and live your life, succeed, build your own family, cherish it, be courageous; life is worth living.",
    "27b46928ea205d18538d152451fee151": "To my parents: I just want to thank you, because you had a choice between the little boy and me, and you welcomed me into your home. Thank you for being a present and loving family.",
    "6ccfd6ba8b0707e523bba58bbb05ebaa": "Ottawa, Ontario K1V 1B3",
    "84755d22d0ae05ef09a9d9352fcc8bf0": "We may provide you areas on the Services to leave reviews or ratings. When posting a review, you must comply with the following criteria: (1) you should have firsthand experience with the person/entity being reviewed; (2) your reviews should not contain offensive profanity, or abusive, racist, offensive, or hateful language; (3) your reviews should not contain discriminatory references based on religion, race, gender, national origin, age, marital status, sexual orientation, or disability; (4) your reviews should not contain references to illegal activity; (5) you should not be affiliated with competitors if posting negative reviews; (6) you should not make any conclusions as to the legality of conduct; (7) you may not post any false or misleading statements; and (8) you may not organize a campaign encouraging others to post reviews, whether positive or negative.",
    "8672961b888635a3b0d309ef795c3cd2": "Message to adoptive parents",
    "b108c744a79f3a0e150fd9757fc814fa": "There may be information on the Services that contains typographical errors, inaccuracies, or omissions, including descriptions, pricing, availability, and various other information. We reserve the right to correct any errors, inaccuracies, or omissions and to change or update the information on the Services at any time, without prior notice.",
    "4ea66dd5d6ca117f218d881688b3824e": "By posting your Contributions to any part of the Services, you automatically grant, and you represent and warrant that you have the right to grant, to us an unrestricted, unlimited, irrevocable, perpetual, non-exclusive, transferable, royalty-free, fully paid, worldwide right, and license to host, use, copy, reproduce, disclose, sell, resell, publish, broadcast, retitle, archive, store, cache, publicly perform, publicly display, reformat, translate, transmit, excerpt (in whole or in part), and distribute such Contributions (including, without limitation, your image and voice) for any purpose, commercial, advertising, or otherwise, and to prepare derivative works of, or incorporate into other works, such Contributions, and grant and authorize sublicenses of the foregoing. The use and distribution may occur in any media formats and through any media channels."
}
